clackups/touch-gamepad/sdkconfig.defaults.waveshare
CONFIG_IDF_TARGET="esp32s3"
CONFIG_TOUCH_GAMEPAD_BOARD_WAVESHARE=y
CONFIG_TOUCH_GAMEPAD_DEFAULT_TRANSPORT_USB=y
CONFIG_TOUCH_GAMEPAD_SCREEN_WIDTH=480
CONFIG_TOUCH_GAMEPAD_SCREEN_HEIGHT=480
CONFIG_TOUCH_GAMEPAD_CORNER_MARGIN=96
CONFIG_TOUCH_GAMEPAD_DEFAULT_THEME_BLUE=y

